# Pandas

* Manipulate & analyse ***tubular*** data
    - tubular data: excel, csv, table-like
* Data stuctures: ***DataFrame*** & ***Series***
    - DataFrame: 2-dimensional
    - Series: 1-dimesional
    - Series can be extracted from DataFrame, also can be added to DataFrame

---

##### Import Packages

In [1]:
import pandas as pd
import numpy as np  #analysis always applys some functions from numpy

#!pip install pandas   #if you are in console, not in jupyter
pd.__version__  #check versions as functions insides may be different

'1.3.4'

# 1. Series
* 1-Dimensional(1D)-list structure
* with ***index*** but no column
* a column in a DataFrame

In [4]:
# Create a Series using a list
ser = pd.Series(['red', 'blue', 'green', 'yellow'])

# type(ser)
ser

#if no index is provided, will be normal index.

0       red
1      blue
2     green
3    yellow
dtype: object

In [2]:
# Create a Series using a list with pre-set index
ser = pd.Series(['red', 'blue', 'green', 'yellow'], index=['a', 'b', 'c', 'd'])

# type(ser)
ser

a       red
b      blue
c     green
d    yellow
dtype: object

In [5]:
ser.ndim 
#check the number of dimension in Series

1

In [6]:
ser.shape
#check the length of series
#the (4,' '),' 'will have number iif this is two dimensions

(4,)

In [7]:
ser.size # row * column,  4 * 1 in this example

4

In [9]:
ser = pd.Series(['red', 'blue', 'green', 'yellow'])

ser.index

#check the index of Series

RangeIndex(start=0, stop=4, step=1)

In [10]:
ser = pd.Series(['red', 'blue', 'green', 'yellow'], index=['a', 'b', 'c', 'd'])

ser.index

#check the index of Series

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
ser.describe()

#check the statistics

count       4
unique      4
top       red
freq        1
dtype: object

In [12]:
ser.value_counts() # value_counts

red       1
blue      1
green     1
yellow    1
dtype: int64

In [13]:
ser[3] # position

'yellow'

In [14]:
ser[1:] # slice

b      blue
c     green
d    yellow
dtype: object

# 2. DataFrame 

* 2D-table structure
* most frequently used stucture in pandas
* with ***columns*** & ***index***
        index ~ row no.
* index could be number or string
* Each Column = 1 Series

In [33]:
# creating dataframe (using dictionary)

df = pd.DataFrame({'name': ['Paul', 'John', 'Mary', 'Jane'],
                   'phone': ['92435678', '90909090', '09090909', '12435678'],
                   'gender': ['male', 'male', 'female', 'female'],
                   'age': [18, 22, 23, np.nan], #np.nan ~ None  ,  nan means not a number
                   'colA': ser},   #adding the series into DataFrame
                  index=['a', 'b', 'c', 'd'])

#dict = DataFrame
#keys = Columns name
#list = Columns value



df

   name     phone  gender   age    colA
a  Paul  92435678    male  18.0     red
b  John  90909090    male  22.0    blue
c  Mary  09090909  female  23.0   green
d  Jane  12435678  female   NaN  yellow

In [21]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.ndim

2

In [19]:
df.shape

(4, 5)

In [18]:
df.size # row x col

20

In [5]:
df.columns

4

In [27]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [28]:
df.set_index('name') # changing index to other column

         phone  gender   age    colA
name
Paul  92435678    male  18.0     red
John  90909090    male  22.0    blue
Mary  09090909  female  23.0   green
Jane  12435678  female   NaN  yellow

In [32]:
#To update df index:

#Method 1
#df.set_index('name', inplace=True) # changing index to other column

#Method 2
df = df.set_index('name')

In [31]:
df.set_index?
#if you don't know how to use set_index, add a '?' after

In [34]:
df.info()

#Check the number of non-null value(nan)

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   phone   4 non-null      object
 2   gender  4 non-null      object
 3   age     3 non-null      float64
 4   colA    4 non-null      object
dtypes: float64(1), object(4)
memory usage: 192.0+ bytes

In [35]:
df.describe()
#check all which can calculate count,mean,...

             age
count   3.000000
mean   21.000000
std     2.645751
min    18.000000
25%    20.000000
50%    22.000000
75%    22.500000
max    23.000000

In [23]:
df.count()
#count non-null value(非空值)

name      4
phone     4
gender    4
age       3
colA      4
dtype: int64

In [36]:
df.shape[0]
#有幾多行

4

## <font color=red>Column</font>

to check the available function of the dataframe

type the name of a dataframe e.g.

df.         ->click tab

In [39]:
#call out the series (a single column), method 1
df.name # dot notation  
#if the name of the column = pre-set function,then cannot use this method

#'name' is the name of the column

a    Paul
b    John
c    Mary
d    Jane
Name: name, dtype: object

In [38]:
#call out the series (a single column), method 2 , better
df['name'] # index

a    Paul
b    John
c    Mary
d    Jane
Name: name, dtype: object

In [42]:
#type will be series
type(df['name']) # index

pandas.core.series.Series

In [40]:
df[['name','age']]  # select multiple column (DF), fancy index

   name   age
a  Paul  18.0
b  John  22.0
c  Mary  23.0
d  Jane   NaN

In [43]:
type(df[['name','age']])  # because more than 1 series

pandas.core.frame.DataFrame

In [45]:
df['color'] = ser # add a column

In [54]:
#dot notation can be use as replace but not create a new column
#e.g.
df.color3 = ser

C:\Users\jacksuen\AppData\Local\Temp/ipykernel_10924/1774691363.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.color3 = ser

In [48]:
df.assign(color2=ser) # add a column using assign function

   name     phone  gender   age    colA   color  color2
a  Paul  92435678    male  18.0     red     red     red
b  John  90909090    male  22.0    blue    blue    blue
c  Mary  09090909  female  23.0   green   green   green
d  Jane  12435678  female   NaN  yellow  yellow  yellow

In [51]:
df

#just use assign will not save

   name     phone  gender   age    colA   color
a  Paul  92435678    male  18.0     red     red
b  John  90909090    male  22.0    blue    blue
c  Mary  09090909  female  23.0   green   green
d  Jane  12435678  female   NaN  yellow  yellow

In [52]:
df = df.assign(color2=ser) # save the assign

In [53]:
df

   name     phone  gender   age    colA   color  color2
a  Paul  92435678    male  18.0     red     red     red
b  John  90909090    male  22.0    blue    blue    blue
c  Mary  09090909  female  23.0   green   green   green
d  Jane  12435678  female   NaN  yellow  yellow  yellow

In [49]:
df['color'][1] # series[pos]

'blue'

In [55]:
#filter() - filter(column name /index name)

df.filter(['name']) # filter by columns (dataframe)

   name
a  Paul
b  John
c  Mary
d  Jane

In [56]:
df.filter(['name','age'], axis='columns') # filter by columns (dataframe)

   name   age
a  Paul  18.0
b  John  22.0
c  Mary  23.0
d  Jane   NaN

In [50]:
df.age.mean()

21.0

In [6]:
df.age.median()

In [6]:
df.age.max() # get max item

In [6]:
df.age.idxmax() # get index value of max item

In [6]:
df.age = df.age + 1

In [6]:
df

In [6]:
df.gender.value_counts()

In [6]:
-(df.age)

In [6]:
df.name.str.upper()

#### Use of Map function to update Column data

In [7]:
# df.name.map(lambda x: 'person-' + x)

# def changeName(name):
#     name = 'person-' + name + '-001'
#     return name

# df.name = df.name.map(changeName)

###### Drop a row / column

In [8]:
# df.drop('d')  # drop a row with a index value

# df.drop(['a','d']) # drop multiple columns
# df.drop('colA', axis='columns') # drop a column with a column name
# df.drop(['phone','colA'], axis=1)

## <font color=red>Rows</font>

In [9]:
# df[0] # WARNING: Position is not working!!! (it's for col name)
# df['a'] # WARNING: Index value is not working!!! (please use loc indexer)

# slice operation (rows)
# df[:] # all rows
# df[:2] # row 0 to 1 
# df[::-1] # reverse order

# Filter()
# Axis 0: rows / index
# Axis 1: columns
# df.filter('a', axis='index')
# df.filter('a',axis=0)
# df.filter(['a','b'],axis=0)

### <font color=blue>**Indexer**</font>

+ loc (label)
+ iloc (position)

#### **df.loc indexer (label)**

In [10]:
# 1. LOC indexer: 
# SYNTAX: df.loc[row, col]

# df.loc['a'] # get 1 row (series)
# df.loc[['a','b']] # get multiple rows
# df.loc[:] # slice
# df.loc['a':'c'] # slice (including c)
# df.loc[['b','b', 'a','a']] # fancy index

# df.loc[:, 'name']
# df.loc[:, ['name', 'age']] # all rows, with name & age column

# BE CAREFUL!!!
# if index is not numbers, you cannot use df.loc[0]
# df.loc[0] # KeyError: no such index value

#### **df.iloc indexer (position)**

In [11]:
# 1. ILOC indexer: 
# SYNTAX: df.iloc[row, col]

# df.iloc[0] # first row
# df.iloc[:] # slice: all rows
# df.iloc[0:1] # 0 to 1 (not include 1)

# df.iloc[:, :] # all rows, all columns
# df.iloc[:, 0] # all rows, first column
# df.iloc[:, [-1]] # all rows, last column
# df.iloc[:, 1]

# BE CAREFUL!!!
# Since it is based on POSITION, you cannot use col labels
# df.iloc[:, 'age'] # not working
# df.iloc[:, ['age']]  # not working

### <font color=Green>**Boolean Mask**</font>

In [12]:
mask = df.age > 20
# ~mask # negate it

# df[mask] # retrieve the results
df.loc[mask] # retrieve the results

# BE CAREFUL!!!
# df.iloc[mask] # iloc indexer cannot use boolean mask!!!

   name     phone  gender   age   colA
b  John  90909090    male  22.0   blue
c  Mary  09090909  female  23.0  green

### <font color=Green>**Query()**</font>

In [13]:
# df.query('age == 22')
# df.query('age > 20')
# df.query('name=="Paul" & age>10')

# Using Python str functions
# df.query('name.str.contains("J")', engine='python')
# df.query('name.str.upper()=="PAUL"', engine='python')

# BE CAREFUL!!!
# df.query('name.str.upper().contains("P")', engine='python') # NOT WORKING
# df.query('name.str.upper().str.contains("P")', engine='python') # WORKING

### Missing Values

In [14]:
# handing NA values
# which element is null

# df.loc[df.age.isna()]

# df[df.age.isnull()] 
# df[df.age.isna()] 
# df[~df.age.isnull()]  # is not NA
# df[df.age.notnull()]  
# df[df.age.notna()]  

df.age.fillna(df.age.mean(), inplace=True) # fill the values (inplace=True if you want to save it)

## <font color=blue>Groupby</font>

##### * divide some data input groups (e.g. gender)

In [15]:
df

   name     phone  gender   age    colA
a  Paul  92435678    male  18.0     red
b  John  90909090    male  22.0    blue
c  Mary  09090909  female  23.0   green
d  Jane  12435678  female  21.0  yellow

In [20]:
# df.groupby('gender').mean()
# df.groupby('gender').age.mean()
# df.groupby('gender')['age'].mean()

gender
female    22.0
male      20.0
Name: age, dtype: float64

In [21]:
# group by multiple columns
df.groupby(['gender', 'name']).mean()

              age
gender name
female Jane  21.0
       Mary  23.0
male   John  22.0
       Paul  18.0

In [22]:
df.groupby(['gender', 'name']).mean().unstack()

         age
name    Jane  John  Mary  Paul
gender
female  21.0   NaN  23.0   NaN
male     NaN  22.0   NaN  18.0

In [23]:
# pivot table function
# df.pivot_table('age', index='gender', columns='name')
df.pivot_table('age', index='gender', columns='name', aggfunc='mean') # aggfunc other than mean

name    Jane  John  Mary  Paul
gender
female  21.0   NaN  23.0   NaN
male     NaN  22.0   NaN  18.0

## <font color=blue>Sorting</font>

In [27]:
# df.sort_values(by='age', ascending=False)
df.sort_values(by=['gender', 'age'], ascending=[False, True])

   name     phone  gender   age    colA
a  Paul  92435678    male  18.0     red
b  John  90909090    male  22.0    blue
d  Jane  12435678  female  21.0  yellow
c  Mary  09090909  female  23.0   green